[MSGTITLE]
msg_default_tile=Onebox
msg_login_tile=Confirm
msg_delConfirm_tile=Confirm
msg_moveConfirm_tile=Confirm
msg_syncsettings_tile=Confirm
msg_setting_sharetil=Confirm
msg_setting_savetile=Confirm
msg_setting_exittile=Confirm
msg_dragFile_setting_title=Upload File
msg_savefile_copymove_title_key=Warning
msg_setting_syncdir_title=Set Synchronization Directory
msg_setting_confirm=Confirm
msg_warning_title=Warning
msg_failure_title=Failure
msg_success_title=Success
msg_message_title=Message
msg_backup_tiptitle=Tips
msg_backup_title=What Is Backup
network_tile=Network
msg_network_wireless_tile=Network
msg_power_tile=Power Supply
msg_teamSpace_viewfailed=Failed to View Team Space
msg_share_delete_allsharer_title=Delete All Sharer
msg_share_system_update_title=Upgrade

[MSGDESC]
msg_system_updating=Upgrading the software...
UpdateMsg=New version detected. Upgrade now?
msg_login_noticeInput=Please enter the user name or password.
msg_login_failed=Login failed. Please check your account/ID or password.
msg_login_locked=The account is locked. Please try again 5 minutes later.
msg_login_changepwd=To protect data security, you must change the initial password and use the new password to log in to the system again.
msg_login_couldntconnect=Request to the server failed, please try again later.
msg_delConfirm_notice=Are you sure of the deletion?
msg_moveConfirm_notice=Are you sure you want to move the selected item(s)?
msg_syncsettings_cancel=Are you sure you want to cancel the synchronization of selected items?
msg_canclShareConfirm_Notice=Are you sure you want to cancel sharing? 
msg_canclShare2meConfirm_Notice=Are you sure you want to exit sharing? 
msg_syncsettings_setting=Are you sure you want to set the synchronization of selected items?
msg_emptydir=The directory is empty.
msg_upload_successful=Succeeded in adding the upload task(s). View the upload progress in the transfer list.
msg_upload_failed=Failed to adding the upload task(s). View the upload progress in the transfer list.
msg_upload_selectdir_failed=Please select Onebox path
msg_download_successful=Succeeded in adding the download task(s). View the download progress in the transfer list.
msg_download_failed=Failed to adding the download task(s). View the download progress in the transfer list.
msg_createdir_successful=Succeeded in create folder
msg_createdir_failed=Failed to create folder
msg_createdir_failed_ex=Failed to create folder, %s
msg_rename_successful=Succeeded in rename
msg_rename_failed=Failed to rename
msg_rename_failed_ex=Failed to rename,%s
msg_cancelsync_successful=Succeeded in cancelling the synchronization.
msg_cancelsync_failed=Failed to cancelling the synchronization.
msg_setsync_successful=Succeeded in set the synchronization.
msg_setsync_failed=Failed to set the synchronization.
msg_selectobject=Select Object
msg_notdest_teamspace=You do not have any team space to transfer the file(s) to.
msg_selectmulti=You can select only one target directory. Please select again.
msg_copy_finished_successful=Copying completed, %d successful.
msg_copy_finished_failed=Copying completed, %d failed.
msg_copy_finished=Copying completed. %d successful and %d failed.
msg_move_finished_successful=Moving completed. %d successful.
msg_move_finished_failed=Moving completed. %d failed.
msg_move_finished=Moving completed. %d successful and %d failed.
msg_savemyfile_finished_successful=Save to myfiles completed. %d successful.
msg_savemyfile_finished_failed=Save to myfiles completed. %d failed.
msg_savemyfile_finished=Save to myfiles completed. %d successful and %d failed.
msg_transteamspace_finished_successful=Transfer to team space completed. %d successful.
msg_transteamspace_finished_failed=Transfer to team space completed. %d failed.
msg_transteamspace_finished=Transfer to team space completed. %d successful and %d failed.

msg_collect_logs=Collecting logs.Please wait...
msg_collect_logs_successful=
msg_collect_logs_failed=

msg_resttask_start=Start to %s
msg_resttask_doing=Please waiting for the last %s
msg_resttask_complete=%s completed
msg_resttask_error=%s failed, %s
delete=delete
copy=copy
save=save
move=move
mark=mark as readed
NoSuchSource=Nonexistent item
NoSuchDest=Nonexistent item
SubFolderConflict=The destination folder is the sub-folder of the source folder
SameNodeConflict=The destination folder is same as the source folder
SameParentConflict=The destination folder is not changed
AsyncNodesConflict=Some items already exist
Forbidden=You have no permission
SystemException=Service aborted

msg_no_permissions=You have no permission
msg_teamSpace_cannotview=You have no permission or the team space has been deleted

msg_dropFile_setting=The task has been added to the upload task list.
msg_teamSpace_name_setting=Team space name cannot exceed 100 characters.
msg_teamSpace_description_setting=Team space description cannot exceed 255 characters.
msg_teamSpace_manager_setting=The user cannot be found. Please check the information.
msg_teamSpace_manager_adduser_setting=The user is already added.
msg_teamSpace_manager_success_setting=Modification successful.
msg_teamSpace_manager_fail_setting=Modification failed.
msg_teamSpace_disband_setting=Please enter "yes"
msg_teamSpace_modify_setting=The user is not a team space member. Confirm the information and continue.

msg_share_not_found=The user cannot be found.
msg_share_batch_add=Part of condition cannot be found the correct user.
msg_share_not_share_myself=You cannot share a file or folder with yourself.
msg_share_share_failed=Sharing failed.
msg_share_has_shared= This user already shared.
msg_share_get_timezone_failed=Failed to obtain the time zone.
msg_share_set_time_error_a=Time setting error. The time cannot be earlier than the current time.
msg_share_set_time_error_b=Time setting error. The expiration time cannot be earlier than the effective time.
msg_share_set_time_error_c=Time setting error. The expiration time has not been set.
msg_share_set_time_error=Time setting error.
msg_share_delete_failed=Failed to delete file(s).
msg_share_delete_allsharer=Are you sure you want to delete all sharer?
msg_share_copy_success=Successfully copied to the clip board.
msg_share_cancel_ask=Are you sure you want to cancel external link?
msg_share_all_cancel_ask=Are you sure you want to cancel all external links?
msg_share_share_too_much=Only 3 external links can be created on a file.
msg_share_not_set_valid_user=You have not specified any valid sharer.
msg_share_set_error_text=The extraction code can contain only digits and letters.
msg_share_select_authority_of_sharelink_user=Please select the permission on the link.
msg_share_code_not_null=The extraction code cannot be empty.
msg_share_mail_is_invalid=Please input the valid mail address.
msg_share_mail_only_one_email_address=Only one email address can be entered.
msg_share_date_is_invalid=The link has expired.
msg_add_full_backup_successed=Succeeded in adding the full disk backup task.
msg_add_full_backup_failed=Failed to add the full disk backup task.

msg_tanserror_noexit=The file does not exist. Recover the file or delete the task.

msg_backup_setting=The selected directory has already been scheduled for back up.
msg_backup_skip_failed=Failed to switch to the Onebox path. Please check whether the Onebox path exists.
msg_backup_create_failed=A maximum of 50 scheduled tasks are supported.
msg_backup_localpath_invalid=Invalid local path. Please restore the original file or delete this task. 
msg_backup_remotepath_invalid=Invalid cloud path. Please restore the original file or delete this task. 
msg_backup_delConfirm_notice=If you ignore this error, the modification of the file is not uploaded to the cloud.

msg_setting_exit=Settings on the current page are not saved. Are you sure you want to exit? 
msg_setting_save=Restart the client to make the new settings to take effect.
msg_setting_change_page_issave=当前页面有设置未保存，是否保存？
msg_dragFile_setting_text=You cannot drag a file on the cloud to a web disk.
msg_savefile_copymove_text_key=Some items already exist. Do you want to have them renamed automatically?
msg_download_change_text_key=unable to download
msg_savefile_copymove_fail_key=The index remains the same.
msg_dragFile_tip_setting_text=Some folders exist by the same name. Do you want to combine them?
msg_teamSpace_empty_name_setting=Team space name cannot be empty.
msg_teamSpace_name_fail_setting=Failed to create team space.
msg_teamSpace_add_manager_all_fail_setting=All members have failed to be added.
msg_teamSpace_add_manager_part_fail_setting=Some members have failed to be added.
msg_vesionfile_delConfirm_notice=Are you sure you want to delete the selected file?This operation cannot be undone.

msg_delMsgConfirm_notice=The selected messages will be deleted. (System messages are undeletable.) Are you sure you want to delete them?

msg_transTask_abnormal_info=Some error occur on subfile.
msg_transTask_addtask_failed=Fail to add transmit task, error message: %s
msg_transTask_has_same_folder=The files already exist,Do you want to have them renamed automatically?

msg_share2me_operation_failed=File:%s operation failed,Error Code:%d,Description:%s,Advice:%s.

msg_search_limit_info=Only %d pieces are displayed.

msg_office_savefile=The file is not saved. Please save it first.
msg_error=Error Code:%d,Description:%s,Advice:%s.
msg_error_no_advice=Error Code:%d,Description:%s.

msg_setsyncdir_morethan100=The selected synchronization directory exceeds 100 characters. 
msg_setsyncdir_invalidpath=Invalid Windows path or network path. 
msg_setsyncdir_invalidchar=The directory name cannot contain special characters including (:*| ?<>"/)
msg_setsyncdir_containspecchar=The path contains special characters. 
msg_setsyncdir_lessthan500M=The available disk space for the selected synchronization directory is less than 500 MB. 
msg_setsyncdir_isbackupdir=The selected synchronization directory has been added to the backup task.  
msg_setsyncdir_notntfs=The selected synchronization directory is a non-NTFS file system. 
msg_setsyncdir_ismountdir=The selected synchronization directory is a mount directory or a sub-directory of a mount directory. 
msg_setting_confirm_context=You need to restart the client to change the interface language. Are you sure you want to continue?

msg_notcdir_is_create=No directory. Create a directory? 
msg_dowloadecdir_create_failed=Failed to create a directory. 

user_msg_share_folder=%s %s has shared folder %s with you
user_msg_share_file=%s %s has shared file %s with you
user_msg_cancel_share_folder=%s %s has canceled the sharing of folder %s
user_msg_cancel_share_file=%s %s has canceled the sharing of file %s
user_msg_join_teamspace=%s %s has added you to team space %s
user_msg_quit_teamspace=%s %s has quit team space %s
user_msg_remove_from_teamspace=%s %s has removed you from team space %s
user_msg_teamspace_upload=%s %s has uploaded file %s to team space %s
user_msg_teamspace_role_update=%s %s has changed your role in team space %s to %s
user_msg_join_group=%s %s has added you to group %s
user_msg_quit_group=%s %s has quit group %s
user_msg_remove_from_group=%s %s has removed you from group %s
user_msg_group_role_update=%s %s has changed your role in group %s to %s
user_msg_system_announcement=%s The system has released a notification %s

msg_backup_des=Backup refers to that data is periodically replicated from the local system to the cloud. If the local system encounters faults or data is lost, backup data on the cloud can be downloaded to the local system to prevent data loss.
msg_synpath_des=synchronization directory, which cannot be added to automatic backup.
msg_fullbackup_closetips=After backup is disabled, local files are not backed up to the cloud. Backup files are still retained. Are you sure you want to disable the backup function?
msg_fullbackup_treenodeexpand=The current version supports the backup of disks and level-1 directories only.

network_wireless_offline=Offline
network_wireless_online=Online
network_offline=For better user experience, use Cloud Manager when Wi-Fi is available.
network_online=Online
power_offline=For better user experience, connect the power cable.
power_online=Wired power supply is in use.

transtask_msg_open_source=Open